<a href="https://colab.research.google.com/github/Void-Brain70/Pandas/blob/main/Dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
df = pd.read_csv("/content/weather_data.csv");
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [2]:
import pandas as pd
info = {
    'Name':['Anik Chandra','Abdul Rab Anik','Anisul islam'],
    'ID':['18101070','18101073','18101079'],
    'Cgpa':['3.67','3.48','3.46']
}
df = pd.DataFrame(info)
df

             Name        ID  Cgpa
0    Anik Chandra  18101070  3.67
1  Abdul Rab Anik  18101073  3.48
2    Anisul islam  18101079  3.46

In [3]:
import pandas as pd
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [6]:
df.shape
rows , columns = df.shape
rows
columns

4

In [7]:
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [9]:
df.head(3)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [10]:
df.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [11]:
df.tail(3)

        day  temperature  windspeed  event
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [12]:
df[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [16]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [17]:
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [18]:
df.event #df['event']

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [19]:
type(df['event'])

pandas.core.series.Series

In [20]:
df[['event','day']]

   event       day
0   Rain  1/1/2017
1  Sunny  1/2/2017
2   Snow  1/3/2017
3   Snow  1/4/2017
4   Rain  1/5/2017
5  Sunny  1/6/2017

In [21]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [22]:
df['temperature'].min()

24

In [23]:
df['temperature'].max()

35

In [24]:
df['temperature'].mean()

30.333333333333332

In [25]:
df['temperature'].std()

3.8297084310253524

In [26]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [ ]:
df[df.temperature>=32]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
4  1/5/2017           32          4   Rain

In [ ]:
# df[df.temperature==df.temperature.max()]
df[df.temperature==df['temperature'].max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [ ]:
df[['day','temperature']][df.temperature==df['temperature'].max()]

        day  temperature
1  1/2/2017           35

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [28]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [30]:
df.set_index('day', inplace=True)

In [31]:
df.loc['1/3/2017']

temperature      28
windspeed         2
event          Snow
Name: 1/3/2017, dtype: object

In [32]:
df.reset_index(inplace=True)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [33]:
df.set_index('event',inplace=True)
df

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Rain   1/5/2017           32          4
Sunny  1/6/2017           31          2

In [34]:
df.loc['Rain']

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Rain   1/5/2017           32          4

In [ ]:
import pandas as pd
data = {
    'Name':['Anik','Rabbi','Mohan','Sowrob','Tayeba','Maria'],
    'University':['UAP','DIU','DIU','AIUB','DIU','IUBAT'],
    'Deparment':['CSE','CSE','TE','CSE','TE','CSE'],
    'Cgpa':['3.67','3.88','3.71','3.78','3.82','3.69']
}
df = pd.DataFrame(data)
df

     Name University Deparment  Cgpa
0    Anik        UAP       CSE  3.67
1   Rabbi        DIU       CSE  3.88
2   Mohan        DIU        TE  3.71
3  Sowrob       AIUB       CSE  3.78
4  Tayeba        DIU        TE  3.82
5   Maria      IUBAT       CSE  3.69

In [ ]:
# df.shape
rows,columns = df.shape
rows

6

In [ ]:
#df.head()
df.head(6)

     Name University Deparment  Cgpa
0    Anik        UAP       CSE  3.67
1   Rabbi        DIU       CSE  3.88
2   Mohan        DIU        TE  3.71
3  Sowrob       AIUB       CSE  3.78
4  Tayeba        DIU        TE  3.82
5   Maria      IUBAT       CSE  3.69

In [ ]:
df.tail()

     Name University Deparment  Cgpa
1   Rabbi        DIU       CSE  3.88
2   Mohan        DIU        TE  3.71
3  Sowrob       AIUB       CSE  3.78
4  Tayeba        DIU        TE  3.82
5   Maria      IUBAT       CSE  3.69

In [ ]:
df[3:4]

     Name University Deparment  Cgpa
3  Sowrob       AIUB       CSE  3.78

In [ ]:
df.columns

Index(['Name', 'University', 'Deparment', 'Cgpa'], dtype='object')

In [ ]:
df.University

0      UAP
1      DIU
2      DIU
3     AIUB
4      DIU
5    IUBAT
Name: University, dtype: object

In [ ]:
type(df['Name'])

pandas.core.series.Series

In [ ]:
df['Cgpa'].max()

'3.88'

In [ ]:
df['Cgpa'].min()

'3.67'

In [ ]:
df.describe()

        Name University Deparment  Cgpa
count      6          6         6     6
unique     6          4         2     6
top     Anik        DIU       CSE  3.67
freq       1          3         4     1

In [ ]:
df[df.Cgpa>='3.60']

     Name University Deparment  Cgpa
0    Anik        UAP       CSE  3.67
1   Rabbi        DIU       CSE  3.88
2   Mohan        DIU        TE  3.71
3  Sowrob       AIUB       CSE  3.78
4  Tayeba        DIU        TE  3.82
5   Maria      IUBAT       CSE  3.69

In [ ]:
df.set_index('Name', inplace=True)
df

       University Deparment  Cgpa
Name
Anik          UAP       CSE  3.67
Rabbi         DIU       CSE  3.88
Mohan         DIU        TE  3.71
Sowrob       AIUB       CSE  3.78
Tayeba        DIU        TE  3.82
Maria       IUBAT       CSE  3.69

In [ ]:
df.loc['Rabbi']

University     DIU
Deparment      CSE
Cgpa          3.88
Name: Rabbi, dtype: object

In [ ]:
df.reset_index(inplace=True)
df

     Name University Deparment  Cgpa
0    Anik        UAP       CSE  3.67
1   Rabbi        DIU       CSE  3.88
2   Mohan        DIU        TE  3.71
3  Sowrob       AIUB       CSE  3.78
4  Tayeba        DIU        TE  3.82
5   Maria      IUBAT       CSE  3.69